Repository: RURBOO/Rurboo-drive-app
Catalog: lib/l10n/app_*.arb
Languages: hi

# appName
source: RURBOO Driver
hi: रूरबू ड्राइवर

source: You are Online
hi: आप ऑनलाइन हैं

source: You are Offline
hi: आप ऑफलाइन हैं

# goOnlineToEarn
source: You are Offline. Go Online to earn.
hi: आप ऑफलाइन हैं। कमाने के लिए ऑनलाइन जाएं।

source: GPS Ready
hi: GPS तैयार है

# searchingGps
source: Searching...
hi: खोज रहा है...

source: New Ride Request
hi: नई राइड रिक्वेस्ट

source: Accept
hi: स्वीकार करें

source: Reject
hi: अस्वीकार करें

source: Navigate
hi: नेविगेट करें

source: Cancel
hi: रद्द करें

source: Pickup
hi: पिकअप

source: Drop
hi: ड्रॉप

# startTrip
source: START TRIP (ENTER OTP)
hi: ट्रिप शुरू करें (OTP डालें)

source: END TRIP
hi: ट्रिप समाप्त करें

source: Cancel Ride
hi: राइड रद्द करें

source: Verify OTP
hi: OTP सत्यापित करें

# enterOtp
source: Enter Customer OTP
hi: ग्राहक का OTP डालें

# earnings
source: My Earnings
hi: मेरी कमाई

# history
source: Ride History
hi: राइड इतिहास

# todayEarnings
source: Today's Earnings
hi: आज की कमाई

# thisWeek
source: Last 7 Days
hi: पिछले 7 दिन

source: Recent History
hi: हाल का इतिहास

source: Gross Earnings
hi: कुल कमाई

source: Platform Fee
hi: प्लेटफ़ॉर्म शुल्क

source: Net Profit
hi: शुद्ध लाभ

source: Cash Collected
hi: नकद प्राप्त

source: View All
hi: सभी देखें

source: Ride Cancelled
hi: राइड रद्द

# rideCancelledByUser
source: The user has cancelled this ride.
hi: यूज़र ने यह राइड रद्द कर दी है।

source: OK
hi: ठीक है

# confirmCancel
source: Cancel Ride?
hi: राइड रद्द करें?

# confirmCancelMsg
source: Are you sure you want to cancel this ride? Frequent cancellations may affect your rating.
hi: क्या आप वाकई यह राइड रद्द करना चाहते हैं? बार-बार रद्द करने से आपकी रेटिंग प्रभावित हो सकती है।

source: No, Go Back
hi: नहीं, वापस जाएं

source: Yes, Cancel
hi: हाँ, रद्द करें

source: Arriving at Pickup
hi: पिकअप के लिए पहुँच रहे हैं

source: Dropping Customer
hi: ग्राहक को छोड़ रहे हैं

source: Calculating...
hi: गणना हो रही है...

source: mins
hi: मिनट

source: Trip Started!
hi: ट्रिप शुरू हो गई!

source: Incorrect OTP
hi: गलत OTP

source: Rides
hi: राइड्स

# noRides
source: No rides yet.
hi: अभी कोई राइड नहीं है।

source: Free Trial
hi: फ्री ट्रायल

# noHistory
source: No ride history found
hi: कोई राइड इतिहास नहीं मिला

source: COMPLETED
hi: पूर्ण

source: Status
hi: स्थिति

source: Unknown
hi: अज्ञात

source: Location Permission Needed
hi: स्थान की अनुमति आवश्यक है

source: Retry
hi: पुनः प्रयास करें

# securityTracking
source: Your location is being tracked for security reasons.
hi: सुरक्षा कारणों से आपकी लोकेशन ट्रेस की जा रही है।

source: Change Language
hi: भाषा बदलें

source: Select Language
hi: भाषा चुनें

source: Hindi
hi: हिंदी

source: Ride Safety Warning
hi: राइड सुरक्षा चेतावनी

# endRideTooFar
source: You are far from the destination. Request passenger approval to end ride?
hi: आप गंतव्य से दूर हैं। क्या आप राइड समाप्त करने के लिए यात्री से अनुमति मांगना चाहते हैं?

source: Request Approval
hi: अनुमति मांगें

# waitingForApproval
source: Waiting for Passenger Approval...
hi: यात्री की अनुमति का इंतजार है...

# rideEndApproved
source: Passenger approved ride end.
hi: यात्री ने अनुमति दे दी है।

# rideEndRejected
source: Passenger rejected ride end.
hi: यात्री ने अनुरोध अस्वीकार कर दिया।

source: Drive. Earn. Grow.
hi: चलाएं। कमाएं। बढ़ें।

source: Phone Number
hi: फ़ोन नंबर

source: Send OTP
hi: OTP भेजें

source: New Driver?
hi: नए ड्राइवर?

source: Register Here
hi: यहाँ रजिस्टर करें

# termsPrivacyLogin
source: By continuing, you agree to our Terms of Service & Privacy Policy
hi: जारी रखकर, आप हमारी सेवा की शर्तों और गोपनीयता नीति से सहमत हैं

source: Driver Registration
hi: ड्राइवर पंजीकरण

source: Personal Details
hi: व्यक्तिगत विवरण

source: Full Name
hi: पूरा नाम

# nameRequired
source: Name is required
hi: नाम आवश्यक है

# nameLengthError
source: Name must be at least 3 characters
hi: नाम कम से कम 3 अक्षरों का होना चाहिए

# nameNumberError
source: Name cannot contain numbers
hi: नाम में अंक नहीं हो सकते

source: Next: Vehicle Details
hi: अगला: वाहन विवरण

# validMobileError
source: Enter a valid 10-digit mobile number
hi: एक वैध 10-अंकीय मोबाइल नंबर दर्ज करें

# phoneRequired
source: Phone number is required
hi: फ़ोन नंबर आवश्यक है

# gpsOffMessage
source: GPS is turned off! You cannot work.
hi: GPS बंद है! आप काम नहीं कर सकते।

source: TURN ON
hi: चालू करें

source: GPS Connected
hi: GPS कनेक्टेड है

# searchingGpsStatus
source: Searching for GPS...
hi: GPS खोज रहा है...

source: Current Speed
hi: वर्तमान गति

source: GPS Accuracy
hi: GPS सटीकता

source: Current Location
hi: वर्तमान स्थान

source: Address not available
hi: पता उपलब्ध नहीं है

source: Recenter Map
hi: मैप को री-सेंटर करें

source: Fetching address...
hi: पता लाया जा रहा है...

# cannotGoOfflineTrip
source: Cannot go offline during a trip
hi: ट्रिप के दौरान ऑफ़लाइन नहीं हो सकते

source: Turn on GPS first!
hi: पहले GPS चालू करें!

# helpAndSupport
source: Help & Support
hi: सहायता और समर्थन

source: FAQs
hi: अक्सर पूछे जाने वाले सवाल

source: Privacy Policy
hi: गोपनीयता नीति

# termsAndConditions
source: Terms & Conditions
hi: नियम और शर्तें

# feedbackAndSuggestions
source: Feedback & Suggestions
hi: प्रतिक्रिया और सुझाव

source: Edit Profile
hi: प्रोफ़ाइल संपादित करें

source: My Documents
hi: मेरे दस्तावेज़

source: Driving License
hi: ड्राइविंग लाइसेंस

# rc
source: Vehicle Registration (RC)
hi: वाहन पंजीकरण (RC)

# insurance
source: Vehicle Insurance
hi: वाहन बीमा

# vehicleFront
source: Vehicle Front Photo
hi: वाहन की फ्रंट फोटो

# numberPlateHint
source: Ensure number plate is visible
hi: सुनिश्चित करें कि नंबर प्लेट दिखाई दे रही है

# uploadSuccess
source: Uploaded successfully ✓
hi: सफलतापूर्वक अपलोड किया गया ✓

source: Upload failed
hi: अपलोड विफल रहा

source: Tap to Upload
hi: अपलोड करने के लिए दबाएं

source: Save Changes
hi: बदलाव सहेजें

# personalDetailsTitle
source: Personal Details
hi: व्यक्तिगत विवरण

# vehicleDetailsTitle
source: Vehicle Details
hi: वाहन विवरण

source: Vehicle Make & Model
hi: वाहन का मॉडल

# vehicleNumberLabel
source: Vehicle Number
hi: वाहन का नंबर

# phoneCannotBeChanged
source: Phone number cannot be changed
hi: फोन नंबर बदला नहीं जा सकता

# newRideNotificationTitle
source: 🚖 New Ride Request!
hi: 🚖 नई राइड रिक्वेस्ट!

# newRideNotificationBody
source: Pickup: {address}
hi: पिकअप: {address}

source: My Profile
hi: मेरी प्रोफाइल

source: Joined
hi: जुड़े

source: Rating
hi: रेटिंग

source: Wallet
hi: वॉलेट

source: Account
hi: खाता

source: Preferences
hi: प्राथमिकताएं

source: Voice Announcements
hi: वॉयस घोषणाएं

# turnOnOffVoice
source: Turn on/off app voice
hi: ऐप वॉयस चालू/बंद करें

source: Delete Account
hi: खाता हटाएं

source: Logout
hi: लॉगआउट

source: My Vehicles
hi: मेरे वाहन

source: Manage Vehicles
hi: वाहन प्रबंधित करें

source: Voice announcements enabled
hi: वॉयस घोषणाएं सक्षम

source: Voice announcements disabled
hi: वॉयस घोषणाएं अक्षम

source: Security Check
hi: सुरक्षा जाँच

# reauthRequired
source: For security, please logout and login again to delete your account.
hi: सुरक्षा के लिए, कृपया अपना खाता हटाने के लिए लॉग आउट करें और फिर से लॉग इन करें।

source: Logout Now
hi: अभी लॉगआउट करें

# deleteAccountConfirm
source: Are you sure you want to delete your account?
hi: क्या आप वाकई अपना खाता हटाना चाहते हैं?

# deleteAccountDesc
source: This action is permanent. You will lose your ride history, earnings data, and profile details immediately.
hi: यह कार्रवाई स्थायी है। आप अपना राइड इतिहास, कमाई का डेटा और प्रोफाइल विवरण तुरंत खो देंगे।

# reasonOptional
source: Reason for leaving (Optional)
hi: छोड़ने का कारण (वैकल्पिक)

# permanentlyDelete
source: Permanently Delete Account
hi: स्थायी रूप से खाता हटाएं

# accountDeletedSuccess
source: Account deleted successfully.
hi: खाता सफलतापूर्वक हटा दिया गया है।

# pendingDuesError
source: You have pending dues of ₹{amount}. Please clear them before deleting your account.
hi: आपका ₹{amount} बकाया है। कृपया अपना खाता हटाने से पहले इसे चुकाएं।

source: Booking for Passenger
hi: यात्री के लिए बुकिंग

source: Recharge Wallet
hi: वॉलेट रिचार्ज करें

# enterRechargeAmount
source: Enter amount to add to your wallet
hi: अपने वॉलेट में जोड़ने के लिए राशि दर्ज करें

# amountLabel
source: Amount
hi: राशि

# amountHint
source: e.g. 500
hi: जैसे 500

# minimumRechargeInfo
source: 💡 Minimum: ₹100
hi: 💡 न्यूनतम: ₹100

source: Pay Now
hi: अभी भुगतान करें

# minRechargeError
source: Minimum recharge amount is ₹100
hi: न्यूनतम रिचार्ज राशि ₹100 है

# paymentGatewayError
source: ⚠️ Payment gateway not configured. Please contact support.
hi: ⚠️ पेमेंट गेटवे कॉन्फ़िगर नहीं है। कृपया सहायता से संपर्क करें।

# paymentSuccessVoice
source: Payment successful! Your wallet has been recharged.
hi: भुगतान सफल रहा! आपका वॉलेट रिचार्ज कर दिया गया है।

# paymentSuccessMsg
source: Payment successful! Wallet updated.
hi: भुगतान सफल! वॉलेट अपडेट हो गया।

# paymentFailedVoice
source: Payment failed. Please try again.
hi: भुगतान विफल रहा। कृपया पुनः प्रयास करें।

# paymentFailedMsg
source: Payment failed: {error}
hi: भुगतान विफल: {error}

# myWalletTitle
source: My Wallet
hi: मेरा वॉलेट

# negativeBalanceWarning
source: Your wallet is negative. Recharge to go online!
hi: आपका वॉलेट बैलेंस नेगेटिव है। ऑनलाइन जाने के लिए रिचार्ज करें!

# walletBalanceLabel
source: Wallet Balance
hi: वॉलेट बैलेंस

# todaysDueLabel
source: Today's Due
hi: आज का बकाया

# addMoneyBtn
source: Add Money via Razorpay
hi: रेज़रपे के माध्यम से पैसे जोड़ें

# commissionInfo
source: 💡 Commission is deducted daily at 11:59 PM
hi: 💡 कमीशन रोजाना रात 11:59 बजे काटा जाता है

source: Transaction History
hi: लेनदेन इतिहास

# noTransactions
source: No transactions yet
hi: अभी तक कोई लेनदेन नहीं

# walletRechargeDescription
source: Wallet Recharge (Razorpay)
hi: वॉलेट रिचार्ज (रेज़रपे)

# gpsNotReady
source: Cannot go online: GPS not ready
hi: ऑनलाइन नहीं जा सकते: GPS तैयार नहीं है

# sessionInvalid
source: Session Invalid. Please logout and login again.
hi: सत्र अमान्य है। कृपया लॉगआउट करें और फिर से लॉगिन करें।

# accountMismatch
source: Account Mismatch. Please relogin to sync.
hi: खाता बेमेल है। सिंक करने के लिए कृपया फिर से लॉगिन करें।

source: Wallet Recharge Required
hi: वॉलेट रिचार्ज आवश्यक है

# goToWalletAndRecharge
source: Go to Wallet & Recharge
hi: वॉलेट पर जाएं और रिचार्ज करें

# requestAlliance
source: Request Driver Alliance
hi: ड्राइवर गठबंधन का अनुरोध करें

# allianceDescription
source: Ask nearby drivers for help. Select issue type:
hi: आस-पास के ड्राइवरों से मदद मांगें। समस्या का प्रकार चुनें:

source: 🔧 Mechanical Failure
hi: 🔧 यांत्रिक विफलता

source: 🚑 Medical Emergency
hi: 🚑 चिकित्सा आपातकाल

source: 🛡️ Security Threat
hi: 🛡️ सुरक्षा खतरा

source: ⚠️ Other Help
hi: ⚠️ अन्य सहायता

source: Alliance Alert!
hi: गठबंधन अलर्ट!

# nearbyDriverNeedsHelp
source: A nearby driver needs {type} help!
hi: आस-पास के ड्राइवर को {type} सहायता चाहिए!

source: Go to Assist
hi: सहायता के लिए जाएं

# tutOnlineTitle
source: Go Online
hi: ऑनलाइन जाएं

# tutOnlineBody
source: Slide this switch to start receiving ride requests from nearby customers.
hi: आस-पास के ग्राहकों से राइड अनुरोध प्राप्त करना शुरू करने के लिए इस स्विच को खिसकाएं।

# tutGpsTitle
source: GPS Status
hi: GPS स्थिति

# tutGpsBody
source: Tap here to see your current speed and GPS accuracy. Green means you're ready!
hi: अपनी वर्तमान गति और GPS सटीकता देखने के लिए यहां टैप करें। हरे रंग का मतलब है कि आप तैयार हैं!

# tutSosTitle
source: Emergency SOS
hi: आपातकालीन SOS

# tutSosBody
source: In case of emergency, tap this button to immediately alert local authorities.
hi: आपात स्थिति में, स्थानीय अधिकारियों को तुरंत सचेत करने के लिए इस बटन पर टैप करें।

# tutAllianceTitle
source: Driver Alliance
hi: ड्राइवर गठबंधन

# tutAllianceBody
source: Mechanical failure or medical emergency? Tap this to ask nearby drivers for help.
hi: यांत्रिक विफलता या चिकित्सा आपातकाल? आस-पास के ड्राइवरों से मदद मांगने के लिए यहां टैप करें।

# tutNavTitle
source: Navigation Bar
hi: नेविगेशन बार

# tutNavBody
source: Switch between Map, your Earnings, and Profile details easily from here.
hi: यहाँ से मैप, अपनी कमाई और प्रोफाइल विवरण के बीच आसानी से स्विच करें।

# slideToStart
source: Slide to Start Trip
hi: ट्रिप शुरू करने के लिए स्लाइड करें

# slideToEnd
source: Slide to End Trip
hi: ट्रिप समाप्त करने के लिए स्लाइड करें

# tripStartedMsg
source: Trip Started!
hi: ट्रिप शुरू हो गई!

# incorrectOtpMsg
source: Incorrect OTP
hi: गलत OTP

# askOtpDescription
source: Ask the customer for the 4-digit OTP to start the ride.
hi: राइड शुरू करने के लिए ग्राहक से 4-अंकीय OTP मांगें।

# onTripHeader
source: On Trip - {status}
hi: ट्रिप पर - {status}

source: Welcome
hi: स्वागत है

# selectPreferredLanguage
source: Please select your preferred language
hi: कृपया अपनी पसंदीदा भाषा चुनें

source: Gender
hi: लिंग

source: Male
hi: पुरुष

source: Female
hi: महिला

source: Other
hi: अन्य

source: Age
hi: उम्र

# ageRequired
source: Age is required
hi: उम्र आवश्यक है

# underageError
source: You must be at least 18 years old
hi: आपकी उम्र कम से कम 18 वर्ष होनी चाहिए

# genderRequired
source: Please select your gender
hi: कृपया अपना लिंग चुनें

source: Emergency Contact Phone
hi: आपातकालीन संपर्क फोन

# validEmergencyPhoneError
source: Valid 10-digit phone required
hi: वैध 10-अंकीय फोन आवश्यक है

# otp_screen_voice
source: OTP screen. Please enter the 6 digit verification code sent to your mobile.
hi: OTP स्क्रीन। कृपया अपने मोबाइल पर भेजा गया 6 अंकों का सत्यापन कोड दर्ज करें।

# otp_resend_failed
source: Failed to resend OTP. Please try again.
hi: OTP फिर से भेजने में विफल। कृपया पुनः प्रयास करें।

# otp_resend_success
source: New OTP sent successfully!
hi: नया OTP सफलतापूर्वक भेज दिया गया है!

# otp_send_error
source: Error sending OTP
hi: OTP भेजने में त्रुटि

# otp_6_digit_error
source: Please enter 6 digit OTP
hi: कृपया 6 अंकों का OTP दर्ज करें

# login_screen_voice
source: Login screen. Please enter your phone number.
hi: लॉगिन स्क्रीन। कृपया अपना फ़ोन नंबर दर्ज करें।

# phone_number_voice
source: Phone number
hi: फ़ोन नंबर

# wallet_screen_voice
source: Wallet screen
hi: वॉलेट स्क्रीन

# payment_success_voice
source: Payment successful! Your wallet has been recharged.
hi: भुगतान सफल रहा! आपका वॉलेट रिचार्ज कर दिया गया है।

# payment_failed_voice
source: Payment failed. Please try again.
hi: भुगतान विफल रहा। कृपया पुनः प्रयास करें।
